# vim: syntax=ruby filetype=ruby
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'solo-io/tap'
tap 'weaveworks/tap'
tap 'adoptopenjdk/openjdk'

# System tools
brew 'gettext', args: ['force-bottle']
brew 'proctools', args: ['force-bottle']
brew 'pstree', args: ['force-bottle']
brew 'coreutils', args: ['force-bottle']
brew 'findutils', args: ['force-bottle']
brew 'htop', args: ['force-bottle']
brew 'gnu-tar', args: ['force-bottle']
brew 'gnu-which', args: ['force-bottle']
brew 'gnu-sed', args: ['force-bottle']
brew 'gnu-indent', args: ['force-bottle']
brew 'grep', args: ['force-bottle']
brew 'gawk', args: ['force-bottle']
brew 'gnutls', args: ['force-bottle']
brew 'gnu-getopt', args: ['force-bottle']
brew 'parallel', args: ['force-bottle']
brew 'screen', args: ['force-bottle']
brew 'ncurses', args: ['force-bottle']
brew 'pv', args: ['force-bottle']
brew 'unrar', args: ['force-bottle']
brew 'sleepwatcher', args: ['force-bottle']

# Development & Power Tools
cask 'iterm2'
cask 'visual-studio-code'
brew 'bash', args: ['force-bottle']
brew 'bash-completion@2', args: ['force-bottle']
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'ack', args: ['force-bottle']
brew 'ccat', args: ['force-bottle']
brew 'diff-so-fancy', args: ['force-bottle']
brew 'git' # no force-bottle: git --exec-path doesn't work, remote helpers missing from path
brew 'gti', args: ['force-bottle']
brew 'go', args: ['force-bottle']
brew 'fzf', args: ['force-bottle']
brew 'grv', args: ['force-bottle']
brew 'hub', args: ['force-bottle']
brew 'jq', args: ['force-bottle']
brew 'node', args: ['force-bottle']
brew 'rust', args: ['force-bottle']
brew 'libyaml', args: ['force-bottle']
brew 'ruby', args: ['force-bottle']
brew 'python2', args: ['force-bottle']
brew 'python3', args: ['force-bottle']
brew 'openssl', args: ['force-bottle']
brew 'ldns', args: ['force-bottle']
brew 'openssh', args: ['force-bottle']
brew 'protobuf', args: ['force-bottle']
brew 'prototool', args: ['force-bottle']
brew 'the_silver_searcher', args: ['force-bottle']
brew 'ripgrep', args: ['force-bottle']
brew 'tree', args: ['force-bottle']
brew 'wget', args: ['force-bottle']
cask 'google-cloud-sdk'
brew 'watch', args: ['force-bottle']
brew 'fd', args: ['force-bottle']
brew 'ncdu', args: ['force-bottle']
brew 'wdiff', args: ['force-bottle']
brew 'entr', args: ['force-bottle']
brew 'bats', args: ['force-bottle']
brew 'tldr', args: ['force-bottle']
brew 'hugo', args: ['force-bottle']
brew 'shellcheck', args: ['force-bottle']
brew 'telnet', args: ['force-bottle']
brew 'mitmproxy', args: ['force-bottle']
brew 'fortio', args: ['force-bottle']
brew 'gdb', args: ['force-bottle']
brew 'maven', args: ['force-bottle']
cask 'adoptopenjdk/openjdk/adoptopenjdk8'
cask 'adoptopenjdk/openjdk/adoptopenjdk11'
cask 'adoptopenjdk'
brew 'azure/draft/draft'
brew 'bazel', args: ['force-bottle']

# Solo.io CLI Tools
brew 'solo-io/tap/glooctl'
brew 'solo-io/tap/squashctl'
brew 'solo-io/tap/supergloo'
brew 'solo-io/tap/sqoopctl'

# Containers
brew 'kubernetes-cli'
brew 'openshift-cli'
brew 'kubernetes-helm'
brew 'kubectx', args: ['force-bottle']
brew 'kube-ps1', args: ['force-bottle']
cask 'minikube'
cask 'minishift'
brew 'docker-machine-driver-hyperkit', args: ['force-bottle']
brew 'skaffold', args: ['force-bottle']
brew 'kustomize', args: ['force-bottle']
brew 'cfssl', args: ['force-bottle']
cask 'docker' # docker for desktop
brew 'awscli', args: ['force-bottle']
brew 'weaveworks/tap/eksctl'
brew 'azure-cli', args: ['force-bottle']

# Fun tools
brew 'asciinema', args: ['force-bottle']
brew 'lolcat', args: ['force-bottle']

# kubernetes dev
brew 'hg', args: ['force-bottle']
brew 'etcd', args: ['force-bottle']

# Desktop Software
cask 'recordit'
cask 'zoomus'
cask 'spectacle'
cask 'google-chrome'
cask 'postman'
